gauthamkumar24/202BProject/Demo/CORTEX_STM32L152_Discovery_IAR/main.c
/*
FreeRTOS V9.0.0 - Copyright (C) 2016 Real Time Engineers Ltd.
All rights reserved

VISIT http://www.FreeRTOS.org TO ENSURE YOU ARE USING THE LATEST VERSION.

This file is part of the FreeRTOS distribution.

FreeRTOS is free software; you can redistribute it and/or modify it under
the terms of the GNU General Public License (version 2) as published by the
Free Software Foundation >>>> AND MODIFIED BY <<<< the FreeRTOS exception.

***************************************************************************
>>!   NOTE: The modification to the GPL is included to allow you to     !<<
>>!   distribute a combined work that includes FreeRTOS without being   !<<
>>!   obliged to provide the source code for proprietary components     !<<
>>!   outside of the FreeRTOS kernel.                                   !<<
***************************************************************************

FreeRTOS is distributed in the hope that it will be useful, but WITHOUT ANY
WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
FOR A PARTICULAR PURPOSE.  Full license text is available on the following
link: http://www.freertos.org/a00114.html

***************************************************************************
*                                                                       *
*    FreeRTOS provides completely free yet professionally developed,    *
*    robust, strictly quality controlled, supported, and cross          *
*    platform software that is more than just the market leader, it     *
*    is the industry's de facto standard.                               *
*                                                                       *
*    Help yourself get started quickly while simultaneously helping     *
*    to support the FreeRTOS project by purchasing a FreeRTOS           *
*    tutorial book, reference manual, or both:                          *
*    http://www.FreeRTOS.org/Documentation                              *
*                                                                       *
***************************************************************************

http://www.FreeRTOS.org/FAQHelp.html - Having a problem?  Start by reading
the FAQ page "My application does not run, what could be wrong?".  Have you
defined configASSERT()?

http://www.FreeRTOS.org/support - In return for receiving this top quality
embedded software for free we request you assist our global community by
participating in the support forum.

http://www.FreeRTOS.org/training - Investing in training allows your team to
be as productive as possible as early as possible.  Now you can receive
FreeRTOS training directly from Richard Barry, CEO of Real Time Engineers
Ltd, and the world's leading authority on the world's leading RTOS.

http://www.FreeRTOS.org/plus - A selection of FreeRTOS ecosystem products,
including FreeRTOS+Trace - an indispensable productivity tool, a DOS
compatible FAT file system, and our tiny thread aware UDP/IP stack.

http://www.FreeRTOS.org/labs - Where new FreeRTOS products go to incubate.
Come and try FreeRTOS+TCP, our new open source TCP/IP stack for FreeRTOS.

http://www.OpenRTOS.com - Real Time Engineers ltd. license FreeRTOS to High
Integrity Systems ltd. to sell under the OpenRTOS brand.  Low cost OpenRTOS
licenses offer ticketed support, indemnification and commercial middleware.

http://www.SafeRTOS.com - High Integrity Systems also provide a safety
engineered and independently SIL3 certified version for use in safety and
mission critical applications that require provable dependability.

1 tab == 4 spaces!
*/

/******************************************************************************
* This project provides two demo applications.  A low power project that
* demonstrates the FreeRTOS tickless mode, and a more comprehensive test and
* demo application.  The configCREATE_LOW_POWER_DEMO setting (defined at the
* top of FreeRTOSConfig.h) is used to select between the two.  The low power
* demo is implemented and described in main_low_power.c.  The more
* comprehensive test and demo application is implemented and described in
* main_full.c.
*
* This file implements the code that is not demo specific, including the
* hardware setup and FreeRTOS hook functions.
*/

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"

/* ST library functions. */
#include "stm32l1xx.h"
#include "discover_board.h"

/*-----------------------------------------------------------*/

/*
* Set up the hardware ready to run this demo.
*/
static void prvSetupHardware( void );

/*
* main_low_power() is used when configCREATE_LOW_POWER_DEMO is set to 1.
* main_full() is used when configCREATE_LOW_POWER_DEMO is set to 0.
* configCREATE_LOW_POWER_DEMO is defined at the top of main.c.
*/
extern void main_low_power( void );
extern void main_full( void );
extern void main_run_time(void);
unsigned long ulTIM6_OverflowCount = 0UL;
unsigned long idlecount =   0UL;


/* Prototypes for the standard FreeRTOS callback/hook functions implemented
within this file. */
void vApplicationMallocFailedHook( void );
void vApplicationIdleHook( void );
void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName );
void vApplicationTickHook( void );
void CheckUsageCallback( float* f );
/*-----------------------------------------------------------*/

int main( void )
{
    /* Prepare the hardware to run this demo. */
    prvSetupHardware();
    
    /* The configCREATE_LOW_POWER_DEMO setting is described at the top of
    this file. */
    #if configCREATE_LOW_POWER_DEMO == 1
    {
        main_low_power();
    }
    #else
    {
        main_full();
    }
    #endif
    
    /* This line will never be reached. */
    return 0;
}
/*-----------------------------------------------------------*/

static void prvSetupHardware( void )
{
    /* GPIO, EXTI and NVIC Init structure declaration */
    GPIO_InitTypeDef GPIO_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    void SystemCoreClockUpdate( void );
    // RCC_GetClocksFreq(clocks_var);
    RCC_MSIRangeConfig( RCC_MSIRange_6 );
   
    /* Essential on STM32 Cortex-M devices. */
#if  configPERFORMANCE_SCALING_MODE == 1
    PerformanceMode();
#endif
    
#if  configPERFORMANCE_SCALING_MODE == 2
    ConservativeMode();
#endif
    NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );
    
    /* Systick is fed from HCLK/8. */
    SysTick_CLKSourceConfig( SysTick_CLKSource_HCLK_Div8 );
    //RCC_HCLKConfig(RCC_SYSCLK_Div8);
    SystemCoreClockUpdate();
    
    /* Set MSI clock range to ~4.194MHz. */
    //RCC_MSIRangeConfig( RCC_MSIRange_6 );
    
    /* Enable the GPIOs clocks. */
    RCC_AHBPeriphClockCmd( RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOC| RCC_AHBPeriph_GPIOD| RCC_AHBPeriph_GPIOE| RCC_AHBPeriph_GPIOH, ENABLE );
    
    /* Enable comparator clocks. */
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_COMP, ENABLE );
    
    /* Enable SYSCFG clocks. */
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG , ENABLE );
    
    /* Set internal voltage regulator to 1.5V. */
    PWR_VoltageScalingConfig( PWR_VoltageScaling_Range1 );
    
    /* Wait Until the Voltage Regulator is ready. */
    while( PWR_GetFlagStatus( PWR_FLAG_VOS ) != RESET );
    
    /* Configure User Button pin as input */
    GPIO_InitStructure.GPIO_Pin = USERBUTTON_GPIO_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
    GPIO_Init( USERBUTTON_GPIO_PORT, &GPIO_InitStructure );
    
    /* Select User Button pin as input source for EXTI Line */
    SYSCFG_EXTILineConfig( EXTI_PortSourceGPIOA, EXTI_PinSource0 );
    
    /* Configure EXT1 Line 0 in interrupt mode trigged on Rising edge */
    EXTI_InitStructure.EXTI_Line = EXTI_Line0 ;  /* PA0 for User button AND IDD_WakeUP */
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init( &EXTI_InitStructure );
    
    /* Enable and set EXTI0 Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = configLIBRARY_LOWEST_INTERRUPT_PRIORITY;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init( &NVIC_InitStructure );
    
    /* Configure the LED_pin as output push-pull for LD3 & LD4 usage */
    GPIO_InitStructure.GPIO_Pin = LD_GREEN_GPIO_PIN | LD_BLUE_GPIO_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init( LD_GPIO_PORT, &GPIO_InitStructure );
    
    /* Force a low level on LEDs */
    GPIO_LOW( LD_GPIO_PORT, LD_GREEN_GPIO_PIN );
    GPIO_LOW( LD_GPIO_PORT, LD_BLUE_GPIO_PIN );
}
/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
    /* vApplicationMallocFailedHook() will only be called if
    configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h.  It is a hook
    function that will get called if a call to pvPortMalloc() fails.
    pvPortMalloc() is called internally by the kernel whenever a task, queue,
    timer or semaphore is created.  It is also called by various parts of the
    demo application.  If heap_1.c or heap_2.c are used, then the size of the
    heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
    FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
    to query the size of free heap space that remains (although it does not
    provide information on how the remaining heap might be fragmented). */
    taskDISABLE_INTERRUPTS();
    for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{
    //  idlecount++;
    /* vApplicationIdleHook() will only be called if configUSE_IDLE_HOOK is set
    to 1 in FreeRTOSConfig.h.  It will be called on each iteration of the idle
    task.  It is essential that code added to this hook function never attempts
    to block in any way (for example, call xQueueReceive() with a block time
    specified, or call vTaskDelay()).  If the application makes use of the
    vTaskDelete() API function (as this demo application does) then it is also
    important that vApplicationIdleHook() is permitted to return to its calling
    function, because it is the responsibility of the idle task to clean up
    memory allocated by the kernel to any task that has since been deleted. */
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
    ( void ) pcTaskName;
    ( void ) pxTask;
    
    /* Run time stack overflow checking is performed if
    configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
    function is called if a stack overflow is detected. */
    taskDISABLE_INTERRUPTS();
    for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationTickHook( void )
{
    /* This function will be called by each tick interrupt if
    configUSE_TICK_HOOK is set to 1 in FreeRTOSConfig.h.  User code can be
    added here, but the tick hook is called from an interrupt context, so
    code must not attempt to block, and only the interrupt safe FreeRTOS API
    functions can be used (those that end in FromISR()). */
}
/*-----------------------------------------------------------*/

void vAssertCalled( unsigned long ulLine, const char * const pcFileName )
{
    volatile unsigned long ulSetToNonZeroInDebuggerToContinue = 0;
    
    /* Parameters are not used. */
    ( void ) ulLine;
    ( void ) pcFileName;
    
    taskENTER_CRITICAL();
    {
        while( ulSetToNonZeroInDebuggerToContinue == 0 )
        {
            /* Use the debugger to set ulSetToNonZeroInDebuggerToContinue to a
            non zero value to step out of this function to the point that raised
            this assert(). */
            __asm volatile( "NOP" );
            __asm volatile( "NOP" );
        }
    }
    taskEXIT_CRITICAL();
}

void vConfigureTimerForRunTimeStats( void )
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure_Run;
    NVIC_InitTypeDef NVIC_InitStructure_Run;
    NVIC_InitTypeDef NVIC_InitStructure_Governor;
    TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure_Governor;
    
    /* The time base for the run time stats is generated by the 16 bit timer 11.
    Each time the timer overflows ulTIM6_OverflowCount is incremented.
    */
    /*11 is chosen so that timer is independent of CPU frequency*/
    
    /*The portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() macro (in FreeRTOSConfig.h) is
    defined to call this function, so the kernel will call this function
    automatically at the appropriate time. */
    
    /* TIM6 clock enable */
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_TIM11, ENABLE );
   
    TIM_ETRClockMode2Config(TIM11,TIM_ExtTRGPSC_OFF,TIM_ExtTRGPolarity_Inverted,0);

    // TIM_SelectInputTrigger(TIM10,TIM_TS_ETRF);
    /* The 16MHz clock divided by 5000 should tick (very) approximately every
    150uS and overflow a 16bit timer (very) approximately every 20 seconds. */
    TIM_TimeBaseStructure_Run.TIM_Period = 65535;
    TIM_TimeBaseStructure_Run.TIM_Prescaler = 0;
    TIM_TimeBaseStructure_Run.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure_Run.TIM_CounterMode = TIM_CounterMode_Up;
    

    
    TIM_TimeBaseInit( TIM11, &TIM_TimeBaseStructure_Run );
 
    /* Only interrupt on overflow events. */
    TIM11->CR1 |= TIM_CR1_URS;

    
    /* Enable the interrupt. */
    TIM_ITConfig( TIM11, TIM_IT_Update, ENABLE );
    TIM_ITConfig( TIM9, TIM_IT_Update, DISABLE );
    
    
    /* Enable the TIM6 global Interrupt */
    NVIC_InitStructure_Run.NVIC_IRQChannel = TIM11_IRQn;
    NVIC_InitStructure_Run.NVIC_IRQChannelPreemptionPriority = configLIBRARY_LOWEST_INTERRUPT_PRIORITY;
    NVIC_InitStructure_Run.NVIC_IRQChannelSubPriority = 0x00; /* Not used as 4 bits are used for the pre-emption priority. */
    NVIC_InitStructure_Run.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure_Run);
    
    TIM_ClearITPendingBit( TIM11, TIM_IT_Update );
    TIM_Cmd( TIM11, ENABLE );
    
  
}
/*-----------------------------------------------------------*/

void TIM11_IRQHandler( void )
{
    /* Interrupt handler for TIM 11
    

    Increment the variable everytime overflow occurs as the value is being read. */
    if( TIM_GetITStatus( TIM11, TIM_IT_Update) != RESET)
    {   TIM_Cmd( TIM11, DISABLE );
        ulTIM6_OverflowCount++;
        TIM_ClearITPendingBit( TIM11, TIM_IT_Update );
        TIM_Cmd( TIM11, ENABLE );
        
    }
}
void CheckUsageCallback( float * f )
{ unsigned long CPU_TICKS=0;
    static float CPU_USAGE=0;
    static unsigned long CPU_IDLE_TICKS;
    static unsigned long PREVIOUS_CPU_TICKS=0;
    static unsigned long CPU_TICKS_PERIOD=0;
    //api to get cpu idle ticks
    vCpuStats(&CPU_IDLE_TICKS);
    portALT_GET_RUN_TIME_COUNTER_VALUE(CPU_TICKS);
    CPU_TICKS_PERIOD=CPU_TICKS-PREVIOUS_CPU_TICKS;
    PREVIOUS_CPU_TICKS=CPU_TICKS;
    CPU_USAGE=(float)CPU_IDLE_TICKS/(float)CPU_TICKS_PERIOD;
    CPU_USAGE=(1-CPU_USAGE)*100;
    *f=CPU_USAGE;
    
}


